



 if (timeOnly >= "23:58" || timeOnly >= "04:00" || timeOnly >= "08:00" || 
    timeOnly >= "12:00" || timeOnly >= "16:00" || timeOnly >= "20:00")
	Пропоную таку логіку архівації: при відкритті нового файлу архівації о 00:01 чи при рестарті програми флаги f_0,
f_4, f_8, f_12, f_16, f_20 встановлюються в true, а arhiv в false.	надалі іде перевірка і по факту arhiv =1 
запускається процес архівації, після закінчення якого arhiv =0 
 	
	if (timeOnly >= "23:58" && f_0) {f_0=0; arhiv =1;}
	if (timeOnly >= "04:00" && f_4) {f_4=0; arhiv =1;}
	if (timeOnly >= "08:00" && f_8) {f_8=0; arhiv =1;}
	if (timeOnly >= "12:00" && f_12) {f_12=0; arhiv =1;}
	if (timeOnly >= "16:00" && f_16) {f_16=0; arhiv =1;}
	if (timeOnly >= "20:00" && f_20) {f_20=0; arhiv =1;}